# IsAvailableIndex Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElevationMarker..::..IsAvailableIndex Method
ElevationMarker Class See Also
---
Returns true if a new elevation ViewSection can be placed at %index%, returns false otherwise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsAvailableIndex(
	int index
)
```

Visual Basic
---
```text
Public Function IsAvailableIndex ( _
	index As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsAvailableIndex(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the ElevationMarker which will be checked.
# ### Return Value
True if an elevation can be created at %index%, false otherwise.
# Remarks
False will be returned if the %index% is already occupied or if %index% is out of range for the ElevationMarker.
# See Also
ElevationMarker Class
Autodesk.Revit.DB Namespace